turbinerotorALM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        tolerance        1e-4;
        relTol           0.0;

        smoother         DIC;//GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    p
    {
        $pcorr;
        tolerance       1e-4;
        relTol          0.0;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0.0;
    }

    "(U|k|omega|nut|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;
    }

    "(U|k|omega|nut|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}


PIMPLE 
{ 
    momentumPredictor yes;
    correctPhi          no;
    nOuterCorrectors    3;
    nCorrectors         3;
    nNonOrthogonalCorrectors 2;
    turbOnFinalIterOnly true;
    pRefCell 1;
    pRefValue 0;
}

relaxationFactors
{

}


// ************************************************************************* //
